KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fd2d4467-c99a-4ae0-9d0c-18b83c88da0a">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f53c0f1-28e1-4b6c-bf6d-4ee84e53f2e7">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86ff623a-1439-42bc-865c-6d1a6f2310ef">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="580adfdd-4e0f-429d-a6b6-26bbd1c484ae">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f24e8e16-21ad-4eeb-a73d-06152c4d9a1e">
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3299776f-a304-476e-a0d9-a9132b128869">
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0789d7c2-8020-4d52-a305-445f9faa9b76">
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="10db127e-a377-4878-8ead-955d0ff48e4d">
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5cb9669e-543b-4d33-b9a2-c6dc788de898">
    <name>ПоставкаПодПринципала</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f53b3b31-9cd3-4a9b-b293-626b3a525d66">
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="889e8977-08be-4aa4-b9d7-0df860d997ab">
    <name>ПередачаМатериаловВПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/ManagerModule.bsl
&ИзменениеИКонтроль("СписокОпераций")
Функция КАНАТ_СписокОпераций()

	СписокОпераций = Новый СписокЗначений;

	ПеремещениеПолуфабрикатов               = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов");
	ПеремещениеПолуфабрикатовМеждуФилиалами = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами");

	ПередачаПродукцииИзКладовой     = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой");
	ПередачаМатериаловВКладовую     = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую");
	ВозвратМатериаловИзКладовой     = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой");

	//++ НЕ УТКА
	ПередачаПродукцииИзПроизводства = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства");
	#Удаление
	ПередачаМатериаловВПроизводство = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
	#КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24++
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		ПередачаМатериаловВПроизводство = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24--
	#конецВставки
	ВозвратМатериаловИзПроизводства = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства");

	СписокОпераций.Добавить(ПередачаПродукцииИзПроизводства, НСтр("ru = 'Передача продукции из производства';
	|en = 'Transfer of products from production'"));
	СписокОпераций.Добавить(ПередачаМатериаловВПроизводство, НСтр("ru = 'Передача материалов в производство';
	|en = 'Transfer of materials to production'"));
	СписокОпераций.Добавить(ВозвратМатериаловИзПроизводства, НСтр("ru = 'Возврат материалов из производства';
	|en = 'Return of materials from production'"));
	//-- НЕ УТКА

	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс") Тогда
		СписокОпераций.Добавить(ПеремещениеПолуфабрикатовМеждуФилиалами, НСтр("ru = 'Перемещение полуфабрикатов между филиалами';
		|en = 'Transfer of semi-finished products between branch offices'"));
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов") Тогда

		СписокОпераций.Добавить(ПередачаПродукцииИзКладовой, НСтр("ru = 'Передача продукции из кладовой';
		|en = 'Transfer of products from shop floor stockroom'"));
		СписокОпераций.Добавить(ПередачаМатериаловВКладовую, НСтр("ru = 'Передача материалов в кладовую';
		|en = 'Transfer of materials to shop floor stockroom'"));
		СписокОпераций.Добавить(ВозвратМатериаловИзКладовой, НСтр("ru = 'Возврат материалов из кладовой';
		|en = 'Return of materials from storeroom'"));
		СписокОпераций.Добавить(ПеремещениеПолуфабрикатов,   НСтр("ru = 'Перемещение полуфабрикатов';
		|en = 'Transfer of semi-finished products'"));

	КонецЕсли;

	ДоступныеХозяйственныеОперации = ОбщегоНазначенияУТВызовСервера.ДоступныеХозяйственныеОперации("Документ.ДвижениеПродукцииИМатериалов");

	Если ДоступныеХозяйственныеОперации <> Неопределено Тогда

		Индекс = СписокОпераций.Количество()-1;

		Пока Индекс >= 0 Цикл

			Если ДоступныеХозяйственныеОперации.Найти(СписокОпераций[Индекс].Значение) = Неопределено Тогда
				СписокОпераций.Удалить(Индекс);
			КонецЕсли;

			Индекс = Индекс -1;

		КонецЦикла;

	КонецЕсли;

	Возврат СписокОпераций;

КонецФункции
